resume.org
#+DATE: <1996-05-01>
* John Sullivan
[[mailto:john-j-sullivan@outlook.com][john-j-sullivan@outlook.com]] | +1-213-910-4003 | [[https://github.com/jjsullivan5196][GitHub]] | [[https://linkedin.com/in/jjsullivan5196][LinkedIn]]

*** Software Engineer | Walmart via Insight Global
March 2021 - September 2023

#+BEGIN_COMMENT
702 SW 8th St, Bentonville, AR 72716
+1-479-273-4000
#+END_COMMENT

/Clojure-based event sourcing, Kafka, Grafana, CI/CD on Kubernetes/

 - Creating solutions for pushing real-time updates of price
   information to stores through the Walmart chain
 - Maintaining and improving a customized, large-scale event sourcing
   pipeline
 - Adding visibility to production performance through Grafana
   dashboards & alerts
 - Designed strategies for app deployment and orchestration on
   Kubernetes

*** Staff Engineer | yU+co
January 2022 - February 2024

#+BEGIN_COMMENT
3450 Cahuenga Blvd W Unit #507, Los Angeles, CA 90068
+1-323-606-5050
#+END_COMMENT

/IT & Network Admin/Automation, Ansible, Active Directory, AWS Deadline (Cinema 4d/AfterEffects), Fullstack web, Python data scraping/

 - Responsible for maintenance and development of studio production
   infrastructure: internal networks, web presence, central storage,
   render farm, etc
 - Implemented policy for digital asset security
 - Provided on-call technical support, resolving hardware and software
   issues to meet deadlines
 - Added IT infrastructure and policy for managed computer usage,
   configuration management, and other pipeline automation for projects
 - Engineering consultant for various internal and external projects,
   guidance for building sustainable systems

*** Software Engineer II | Capture2
July 2018 - August 2019

#+BEGIN_COMMENT
2820 Camino Del Rio South #209, San Diego, CA 92108
+1-442-227-2946
#+END_COMMENT

/SaaS application on ASP.NET, Frontend JavaScript, React, Java-Spring/Python/ASP.NET Core microservices, Azure Automation & Containerization (Docker, Ansible), SQL Server persistence and ETL, Elasticsearch document indexing and search performance (Kibana)/

 - Developed and maintained software for researching government
   business opportunities, including web/HTTP APIs, javascript
   frontend apps, scraping tools, etc
 - Created reporting integrations for Microsoft Office, allowing
   customers to create reports using tools they're already familiar
   with
 - Helped customers locate relevant business opportunities faster
 - Reduced churn on application maintenance with automation and
   performance monitoring

#+latex: \clearpage
 
*** Software Developer (Freelance)
January 2020

/Fullstack JavaScript, React, Svelte, ClojureScript, PHP, Nodejs, MySQL, ASP.NET Core, CMS/Hugo, Cloud native AWS/Azure/

 - Provide technical services to clients, such as backend software or
   web development
 - Determine scope and outcomes for client projects
 - Consulting for frontend design testing, software installation and
   operations, hosting, recurring costs, etc
 - Delivered such products as a scheduler for an interactive LED
   display at the LA Music Center, custom web applications for clients
   like the Fowler Museum at UCLA, client portfolio websites, and more

*** Undergrad Researcher | CSUMB-UROC Research Internship
May 2016 - August 2017

#+BEGIN_COMMENT
100 Campus Ctr, Seaside, CA 93955
+1-831-582-3000
#+END_COMMENT

/Python Data Science stack, scikit, pandas, TensorFlow, RStudio, Unity Game Engine, Virtual Reality R&D/

 - Synthesized original research in computer input peripherals
 - Used data science methodologies to test signal processing and
   classification techniques for gesture recognition
 - Assisted in other VR/peripheral related projects in a cooperative
   lab environment, particularly in sysadmin and creating solutions
   with the Unity game engine
 
*** Teaching Assistant | TA++ Program, CSUMB School of Computing and Design
August 2016 - June 2018

#+BEGIN_COMMENT
100 Campus Ctr, Seaside, CA 93955
+1-831-582-3000
#+END_COMMENT

 - Delivered quality instructional assistance to the Intro, Multimedia, and Web
   programming classes
 - Advised students on technical considerations for python multimedia projects
 - Collaborated on an engaging intro programming curriculum including in class
   labs, study sessions, and extracurricular activities
 - Directed Peer-Led-Team-Learning sessions that improved student
   cooperation and practical problem-solving skills

*** Education
B.S. Computer Science, CSU Monterey Bay, May 2018
