resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-08 Thu 15:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="john" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<div id="outline-container-org7931f30" class="outline-2">
<h2 id="org7931f30">John Sullivan</h2>
<div class="outline-text-2" id="text-org7931f30">
<p>
<a href="mailto:john-j-sullivan@outlook.com">john-j-sullivan@outlook.com</a> | +1-213-910-4003 | <a href="https://github.com/jjsullivan5196">GitHub</a> | <a href="https://linkedin.com/in/jjsullivan5196">LinkedIn</a>
</p>
</div>

<div id="outline-container-orgc468989" class="outline-4">
<h4 id="orgc468989">Software Engineer | Walmart via Insight Global</h4>
<div class="outline-text-4" id="text-orgc468989">
<p>
March 2021 - September 2023
</p>

<p>
<i>Clojure-based event sourcing, Kafka, Grafana, CI/CD on Kubernetes</i>
</p>

<ul class="org-ul">
<li>Creating solutions for pushing real-time updates of price
information to stores through the Walmart chain</li>
<li>Maintaining and improving a customized, large-scale event sourcing
pipeline</li>
<li>Adding visibility to production performance through Grafana
dashboards &amp; alerts</li>
<li>Designed strategies for app deployment and orchestration on
Kubernetes</li>
</ul>
</div>
</div>

<div id="outline-container-org81ce748" class="outline-4">
<h4 id="org81ce748">Staff Engineer | yU+co</h4>
<div class="outline-text-4" id="text-org81ce748">
<p>
January 2022 - February 2024
</p>

<p>
<i>IT &amp; Network Admin/Automation, Ansible, Active Directory, AWS Deadline (Cinema 4d/AfterEffects), Fullstack web, Python data scraping</i>
</p>

<ul class="org-ul">
<li>Responsible for maintenance and development of studio production
infrastructure: internal networks, web presence, central storage,
render farm, etc</li>
<li>Implemented policy for digital asset security</li>
<li>Provided on-call technical support, resolving hardware and software
issues to meet deadlines</li>
<li>Added IT infrastructure and policy for managed computer usage,
configuration management, and other pipeline automation for projects</li>
<li>Engineering consultant for various internal and external projects,
guidance for building sustainable systems</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb0ac32" class="outline-4">
<h4 id="orgdb0ac32">Software Engineer II | Capture2</h4>
<div class="outline-text-4" id="text-orgdb0ac32">
<p>
July 2018 - August 2019
</p>

<p>
<i>SaaS application on ASP.NET, Frontend JavaScript, React, Java-Spring/Python/ASP.NET Core microservices, Azure Automation &amp; Containerization (Docker, Ansible), SQL Server persistence and ETL, Elasticsearch document indexing and search performance (Kibana)</i>
</p>

<ul class="org-ul">
<li>Developed and maintained software for researching government
business opportunities, including web/HTTP APIs, javascript
frontend apps, scraping tools, etc</li>
<li>Created reporting integrations for Microsoft Office, allowing
customers to create reports using tools they're already familiar
with</li>
<li>Helped customers locate relevant business opportunities faster</li>
<li>Reduced churn on application maintenance with automation and
performance monitoring</li>
</ul>
</div>
</div>

<div id="outline-container-org64ef47c" class="outline-4">
<h4 id="org64ef47c">Software Developer (Freelance)</h4>
<div class="outline-text-4" id="text-org64ef47c">
<p>
January 2020
</p>

<p>
<i>Fullstack JavaScript, React, Svelte, ClojureScript, PHP, Nodejs, MySQL, ASP.NET Core, CMS/Hugo, Cloud native AWS/Azure</i>
</p>

<ul class="org-ul">
<li>Provide technical services to clients, such as backend software or
web development</li>
<li>Determine scope and outcomes for client projects</li>
<li>Consulting for frontend design testing, software installation and
operations, hosting, recurring costs, etc</li>
<li>Delivered such products as a scheduler for an interactive LED
display at the LA Music Center, custom web applications for clients
like the Fowler Museum at UCLA, client portfolio websites, and more</li>
</ul>
</div>
</div>

<div id="outline-container-org5ed3e0f" class="outline-4">
<h4 id="org5ed3e0f">Undergrad Researcher | CSUMB-UROC Research Internship</h4>
<div class="outline-text-4" id="text-org5ed3e0f">
<p>
May 2016 - August 2017
</p>

<p>
<i>Python Data Science stack, scikit, pandas, TensorFlow, RStudio, Unity Game Engine, Virtual Reality R&amp;D</i>
</p>

<ul class="org-ul">
<li>Synthesized original research in computer input peripherals</li>
<li>Used data science methodologies to test signal processing and
classification techniques for gesture recognition</li>
<li>Assisted in other VR/peripheral related projects in a cooperative
lab environment, particularly in sysadmin and creating solutions
with the Unity game engine</li>
</ul>
</div>
</div>

<div id="outline-container-org143a402" class="outline-4">
<h4 id="org143a402">Teaching Assistant | TA++ Program, CSUMB School of Computing and Design</h4>
<div class="outline-text-4" id="text-org143a402">
<p>
August 2016 - June 2018
</p>

<ul class="org-ul">
<li>Delivered quality instructional assistance to the Intro, Multimedia, and Web
programming classes</li>
<li>Advised students on technical considerations for python multimedia projects</li>
<li>Collaborated on an engaging intro programming curriculum including in class
labs, study sessions, and extracurricular activities</li>
<li>Directed Peer-Led-Team-Learning sessions that improved student
cooperation and practical problem-solving skills</li>
</ul>
</div>
</div>

<div id="outline-container-org7a3ee11" class="outline-4">
<h4 id="org7a3ee11">Education</h4>
<div class="outline-text-4" id="text-org7a3ee11">
<p>
B.S. Computer Science, CSU Monterey Bay, May 2018
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 1996-05-01 Wed 00:00</p>
<p class="author">Author: john</p>
<p class="date">Created: 2025-05-08 Thu 15:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
